apache/nuttx/arch/arm/src/stm32/hardware/stm32g4xxv_pinmap_legacy.h
#define GPIO_PD0_EVENTOUT              (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN0)
#define GPIO_PD1_EVENTOUT              (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN1)
#define GPIO_PD2_EVENTOUT              (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN2)
#define GPIO_PD3_EVENTOUT              (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN3)
#define GPIO_PD4_EVENTOUT              (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN4)
#define GPIO_PD5_EVENTOUT              (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN5)
#define GPIO_PD6_EVENTOUT              (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN6)
#define GPIO_PD7_EVENTOUT              (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN7)
#define GPIO_PD8_EVENTOUT              (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN8)
#define GPIO_PD9_EVENTOUT              (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN9)
#define GPIO_PD10_EVENTOUT             (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN10)
#define GPIO_PD11_EVENTOUT             (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN11)
#define GPIO_PD12_EVENTOUT             (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN12)
#define GPIO_PD13_EVENTOUT             (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN13)
#define GPIO_PD14_EVENTOUT             (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN14)
#define GPIO_PD15_EVENTOUT             (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN15)

#define GPIO_PE0_EVENTOUT              (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN0)
#define GPIO_PE1_EVENTOUT              (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN1)
#define GPIO_PE2_EVENTOUT              (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN2)
#define GPIO_PE3_EVENTOUT              (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN3)
#define GPIO_PE4_EVENTOUT              (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN4)
#define GPIO_PE5_EVENTOUT              (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN5)
#define GPIO_PE6_EVENTOUT              (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN6)
#define GPIO_PE7_EVENTOUT              (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN7)
#define GPIO_PE8_EVENTOUT              (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN8)
#define GPIO_PE9_EVENTOUT              (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN9)
#define GPIO_PE10_EVENTOUT             (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN10)
#define GPIO_PE11_EVENTOUT             (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN11)
#define GPIO_PE12_EVENTOUT             (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN12)
#define GPIO_PE13_EVENTOUT             (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN13)
#define GPIO_PE14_EVENTOUT             (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN14)
#define GPIO_PE15_EVENTOUT             (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN15)

#define GPIO_PF0_EVENTOUT              (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN0)
#define GPIO_PF1_EVENTOUT              (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN1)
#define GPIO_PF2_EVENTOUT              (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN2)
#define GPIO_PF9_EVENTOUT              (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN9)
#define GPIO_PF10_EVENTOUT             (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN10)

#define GPIO_PG10_EVENTOUT             (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN10)

/* FDCAN ********************************************************************/

#define GPIO_FDCAN1_RX_1               (GPIO_ALT | GPIO_AF9 | GPIO_SPEED_50MHz | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN11)
#define GPIO_FDCAN1_RX_2               (GPIO_ALT | GPIO_AF9 | GPIO_SPEED_50MHz | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN8)
#define GPIO_FDCAN1_TX_1               (GPIO_ALT | GPIO_AF9 | GPIO_SPEED_50MHz | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN12)
#define GPIO_FDCAN1_TX_2               (GPIO_ALT | GPIO_AF9 | GPIO_SPEED_50MHz | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN9)

#define GPIO_FDCAN2_RX_1               (GPIO_ALT | GPIO_AF9 | GPIO_SPEED_50MHz | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN5)
#define GPIO_FDCAN2_RX_2               (GPIO_ALT | GPIO_AF9 | GPIO_SPEED_50MHz | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN12)
#define GPIO_FDCAN2_TX_1               (GPIO_ALT | GPIO_AF9 | GPIO_SPEED_50MHz | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN6)
#define GPIO_FDCAN2_TX_2               (GPIO_ALT | GPIO_AF9 | GPIO_SPEED_50MHz | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN13)

#define GPIO_FDCAN3_RX_1               (GPIO_ALT | GPIO_AF11 | GPIO_SPEED_50MHz | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN8)
#define GPIO_FDCAN3_RX_2               (GPIO_ALT | GPIO_AF11 | GPIO_SPEED_50MHz | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN3)
#define GPIO_FDCAN3_TX_1               (GPIO_ALT | GPIO_AF11 | GPIO_SPEED_50MHz | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN15)
#define GPIO_FDCAN3_TX_2               (GPIO_ALT | GPIO_AF11 | GPIO_SPEED_50MHz | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN4)

/* FMC/FSMC - Flexible Static Memory Controller *****************************/

#define GPIO_FMC_A0                    (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTF | GPIO_PIN10)
#define GPIO_FMC_A16                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTD | GPIO_PIN11)
#define GPIO_FMC_A17                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTD | GPIO_PIN12)
#define GPIO_FMC_A18                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTD | GPIO_PIN13)
#define GPIO_FMC_A19                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTE | GPIO_PIN3)
#define GPIO_FMC_A2                    (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTF | GPIO_PIN2)
#define GPIO_FMC_A20                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTE | GPIO_PIN4)
#define GPIO_FMC_A21                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTE | GPIO_PIN5)
#define GPIO_FMC_A22                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTE | GPIO_PIN6)
#define GPIO_FMC_A23                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTE | GPIO_PIN2)
#define GPIO_FMC_A25                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTF | GPIO_PIN9)
#define GPIO_FMC_CLK                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTD | GPIO_PIN3)
#define GPIO_FMC_D0                    (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTD | GPIO_PIN14)
#define GPIO_FMC_D1                    (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTD | GPIO_PIN15)
#define GPIO_FMC_D10                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTE | GPIO_PIN13)
#define GPIO_FMC_D11                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTE | GPIO_PIN14)
#define GPIO_FMC_D12                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTE | GPIO_PIN15)
#define GPIO_FMC_D13                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTD | GPIO_PIN8)
#define GPIO_FMC_D14                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTD | GPIO_PIN9)
#define GPIO_FMC_D15                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTD | GPIO_PIN10)
#define GPIO_FMC_D2                    (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTD | GPIO_PIN0)
#define GPIO_FMC_D3                    (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTD | GPIO_PIN1)
#define GPIO_FMC_D4                    (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTE | GPIO_PIN7)
#define GPIO_FMC_D5                    (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTE | GPIO_PIN8)
#define GPIO_FMC_D6                    (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTE | GPIO_PIN9)
#define GPIO_FMC_D7                    (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTE | GPIO_PIN10)
#define GPIO_FMC_D8                    (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTE | GPIO_PIN11)
#define GPIO_FMC_D9                    (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTE | GPIO_PIN12)
#define GPIO_FMC_DA0                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTD | GPIO_PIN14)
#define GPIO_FMC_DA1                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTD | GPIO_PIN15)
#define GPIO_FMC_DA10                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTE | GPIO_PIN13)
#define GPIO_FMC_DA11                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTE | GPIO_PIN14)
#define GPIO_FMC_DA12                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTE | GPIO_PIN15)
#define GPIO_FMC_DA13                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTD | GPIO_PIN8)
#define GPIO_FMC_DA14                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTD | GPIO_PIN9)
#define GPIO_FMC_DA15                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTD | GPIO_PIN10)
#define GPIO_FMC_DA2                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTD | GPIO_PIN0)
#define GPIO_FMC_DA3                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTD | GPIO_PIN1)
#define GPIO_FMC_DA4                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTE | GPIO_PIN7)
#define GPIO_FMC_DA5                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTE | GPIO_PIN8)
#define GPIO_FMC_DA6                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTE | GPIO_PIN9)
#define GPIO_FMC_DA7                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTE | GPIO_PIN10)
#define GPIO_FMC_DA8                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTE | GPIO_PIN11)
#define GPIO_FMC_DA9                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTE | GPIO_PIN12)
#define GPIO_FMC_NBL0                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTE | GPIO_PIN0)
#define GPIO_FMC_NBL1                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTE | GPIO_PIN1)
#define GPIO_FMC_NCE                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTD | GPIO_PIN7)
#define GPIO_FMC_NE1                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTD | GPIO_PIN7)
#define GPIO_FMC_NL                    (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTB | GPIO_PIN7)
#define GPIO_FMC_NOE                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTD | GPIO_PIN4)
#define GPIO_FMC_NWAIT                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTD | GPIO_PIN6)
#define GPIO_FMC_NWE                   (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_SPEED_120MHz | GPIO_PORTD | GPIO_PIN5)

/* HRTIM - High-Resolution Timer ********************************************/

#define GPIO_HRTIM1_CHA1               (GPIO_ALT | GPIO_AF13 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_HRTIM1_CHA2               (GPIO_ALT | GPIO_AF13 | GPIO_PORTA | GPIO_PIN9)
#define GPIO_HRTIM1_CHB1               (GPIO_ALT | GPIO_AF13 | GPIO_PORTA | GPIO_PIN10)
#define GPIO_HRTIM1_CHB2               (GPIO_ALT | GPIO_AF13 | GPIO_PORTA | GPIO_PIN11)
#define GPIO_HRTIM1_CHC1               (GPIO_ALT | GPIO_AF13 | GPIO_PORTB | GPIO_PIN12)
#define GPIO_HRTIM1_CHC2               (GPIO_ALT | GPIO_AF13 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_HRTIM1_CHD1               (GPIO_ALT | GPIO_AF13 | GPIO_PORTB | GPIO_PIN14)
#define GPIO_HRTIM1_CHD2               (GPIO_ALT | GPIO_AF13 | GPIO_PORTB | GPIO_PIN15)
#define GPIO_HRTIM1_CHE1               (GPIO_ALT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN8)
#define GPIO_HRTIM1_CHE2               (GPIO_ALT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN9)
#define GPIO_HRTIM1_CHF1               (GPIO_ALT | GPIO_AF13 | GPIO_PORTC | GPIO_PIN6)
#define GPIO_HRTIM1_CHF2               (GPIO_ALT | GPIO_AF13 | GPIO_PORTC | GPIO_PIN7)
#define GPIO_HRTIM1_EEV1               (GPIO_ALT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN12)
#define GPIO_HRTIM1_EEV10_1            (GPIO_ALT | GPIO_AF13 | GPIO_PORTC | GPIO_PIN5)
#define GPIO_HRTIM1_EEV10_2            (GPIO_ALT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN6)
#define GPIO_HRTIM1_EEV2               (GPIO_ALT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN11)
#define GPIO_HRTIM1_EEV3               (GPIO_ALT | GPIO_AF13 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_HRTIM1_EEV4               (GPIO_ALT | GPIO_AF13 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_HRTIM1_EEV5               (GPIO_ALT | GPIO_AF13 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_HRTIM1_EEV6               (GPIO_ALT | GPIO_AF13 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_HRTIM1_EEV7               (GPIO_ALT | GPIO_AF13 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_HRTIM1_EEV8               (GPIO_ALT | GPIO_AF13 | GPIO_PORTB | GPIO_PIN8)
#define GPIO_HRTIM1_EEV9               (GPIO_ALT | GPIO_AF13 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_HRTIM1_FLT1               (GPIO_ALT | GPIO_AF13 | GPIO_PORTA | GPIO_PIN12)
#define GPIO_HRTIM1_FLT2               (GPIO_ALT | GPIO_AF13 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_HRTIM1_FLT3               (GPIO_ALT | GPIO_AF13 | GPIO_PORTB | GPIO_PIN10)
#define GPIO_HRTIM1_FLT4               (GPIO_ALT | GPIO_AF13 | GPIO_PORTB | GPIO_PIN11)
#define GPIO_HRTIM1_FLT5_1             (GPIO_ALT | GPIO_AF13 | GPIO_PORTB | GPIO_PIN0)
#define GPIO_HRTIM1_FLT5_2             (GPIO_ALT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN7)
#define GPIO_HRTIM1_FLT6               (GPIO_ALT | GPIO_AF13 | GPIO_PORTC | GPIO_PIN10)
#define GPIO_HRTIM1_SCIN_1             (GPIO_ALT | GPIO_AF13 | GPIO_PORTB | GPIO_PIN2)
#define GPIO_HRTIM1_SCIN_2             (GPIO_ALT | GPIO_AF12 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_HRTIM1_SCOUT_1            (GPIO_ALT | GPIO_AF13 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_HRTIM1_SCOUT_2            (GPIO_ALT | GPIO_AF12 | GPIO_PORTB | GPIO_PIN3)

/* I2C **********************************************************************/

#define GPIO_I2C1_SCL_1                (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTA | GPIO_PIN13)
#define GPIO_I2C1_SCL_2                (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTA | GPIO_PIN15)
#define GPIO_I2C1_SCL_3                (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTB | GPIO_PIN8)
#define GPIO_I2C1_SDA_1                (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTA | GPIO_PIN14)
#define GPIO_I2C1_SDA_2                (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTB | GPIO_PIN7)
#define GPIO_I2C1_SDA_3                (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTB | GPIO_PIN9)
#define GPIO_I2C1_SMBA                 (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN5)
#define GPIO_I2C2_SCL_1                (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTA | GPIO_PIN9)
#define GPIO_I2C2_SCL_2                (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTC | GPIO_PIN4)
#define GPIO_I2C2_SCL_3                (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTF | GPIO_PIN6)
#define GPIO_I2C2_SDA_1                (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTA | GPIO_PIN8)
#define GPIO_I2C2_SDA_2                (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTF | GPIO_PIN0)
#define GPIO_I2C2_SMBA_1               (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN10)
#define GPIO_I2C2_SMBA_2               (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN12)
#define GPIO_I2C2_SMBA_3               (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_PUSHPULL | GPIO_PORTF | GPIO_PIN2)
#define GPIO_I2C3_SCL_1                (GPIO_ALT | GPIO_AF2 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTA | GPIO_PIN8)
#define GPIO_I2C3_SCL_2                (GPIO_ALT | GPIO_AF8 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTC | GPIO_PIN8)
#define GPIO_I2C3_SDA_1                (GPIO_ALT | GPIO_AF8 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTB | GPIO_PIN5)
#define GPIO_I2C3_SDA_2                (GPIO_ALT | GPIO_AF8 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTC | GPIO_PIN9)
#define GPIO_I2C3_SDA_3                (GPIO_ALT | GPIO_AF8 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTC | GPIO_PIN11)
#define GPIO_I2C3_SMBA_1               (GPIO_ALT | GPIO_AF2 | GPIO_SPEED_50MHz | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN9)
#define GPIO_I2C3_SMBA_2               (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN2)
#define GPIO_I2C4_SCL_1                (GPIO_ALT | GPIO_AF3 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTA | GPIO_PIN13)
#define GPIO_I2C4_SCL_2                (GPIO_ALT | GPIO_AF8 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTC | GPIO_PIN6)
#define GPIO_I2C4_SDA_1                (GPIO_ALT | GPIO_AF3 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTB | GPIO_PIN7)
#define GPIO_I2C4_SDA_2                (GPIO_ALT | GPIO_AF8 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTC | GPIO_PIN7)
#define GPIO_I2C4_SMBA_1               (GPIO_ALT | GPIO_AF3 | GPIO_SPEED_50MHz | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN14)
#define GPIO_I2C4_SMBA_2               (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_PUSHPULL | GPIO_PORTD | GPIO_PIN11)

/* I2S **********************************************************************/

